# Data 200: Data Systems for Data Analytics (Spring 2024)

# Homework 8: Single Table Operations with SQL part 2

<font color='red'>**Due Date and Time:** 11:59pm on Tuesday, 3/19/2024 </font>
---
Enter your name in the markdown cell below.

# Name: Minh Trinh

In [1]:
## RUN THIS CELL TO GET THE RIGHT FORMATTING AND TO LOAD NumPy
import requests
import numpy as np
from IPython.core.display import HTML
styles = requests.get("https://raw.githubusercontent.com/Harvard-IACS/2018-CS109A/master/content/styles/cs109.css").text
HTML(styles)

# Tasks

- **Make sure you have installed SQL Magic before beginning**--see pages 177-179 in the Course Notes.
- Review pages 203-215 in the Course Notes.
- Complete the **Filtering Records**, **Aggregate Functions**, and **Sorting and Grouping** chapters of the **Intermediate SQL** course on DataCamp.
- E-mail me your completed Jupyter notebook.

# Exercises

This homework will make use of both the `book.db` and `school.db` databases, which are available under Files in Teams.  I suggest that you review pages 181-183 and 225-227 in the Course Notes to familiarize yourself with the tables in these databases.  You may also want to open the `school.db` database in SQLiteStudio to examine the tables as you work on the queries below.

**Download the `book.db` and `school.db` databases from Teams and save them to the same directory as this notebook.**

**Then, run the code cells below to load the SQL Magic module and connect to the `book.db` database.**

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///book.db

'Connected: @book.db'

<div class="exercise"><b>Exercise 1:</b></div> 

With regards to the `indicators` table, project the `year`, `code`, `gdp`, `imports`, and `exports` fields, and create a new (Boolean) column named `new` that that indicates whether `exports` are larger than `imports`.  Sort by `exports` in descending order and limit the results to 10 rows.

The output from my solution is:<br>
<code>
year	code	gdp	   imports	  exports	new
2014	CHN	10438.5	1963110.0	2343220.0	1
2015	CHN	11015.5	1601760.0	2280540.0	1
2017	CHN	12143.5	1832130.0	2280090.0	1
2013	CHN	9570.41	1949300.0	2210660.0	1
2016	CHN	11138.0	1589460.0	2136590.0	1
2012	CHN	8532.23	1817340.0	2050090.0	1
2011	CHN	7551.5 	1741430.0	1899280.0	1
2014	USA	17521.8	2347680.0	1620480.0	0
2010	CHN	6087.16	1393910.0	1578440.0	1
2013	USA	16784.8	2268370.0	1578430.0	0
</code>

In [4]:
%%sql
/* Enter your SQL query below */
SELECT year, code, gdp, imports, exports,
CASE WHEN exports > imports THEN TRUE ELSE FALSE END AS new
FROM indicators
ORDER BY exports DESC
LIMIT 10;

 * sqlite:///book.db
Done.

[(2014, 'CHN', 10438.5, 1963110.0, 2343220.0, 1),
 (2015, 'CHN', 11015.5, 1601760.0, 2280540.0, 1),
 (2017, 'CHN', 12143.5, 1832130.0, 2280090.0, 1),
 (2013, 'CHN', 9570.41, 1949300.0, 2210660.0, 1),
 (2016, 'CHN', 11138.0, 1589460.0, 2136590.0, 1),
 (2012, 'CHN', 8532.23, 1817340.0, 2050090.0, 1),
 (2011, 'CHN', 7551.5, 1741430.0, 1899280.0, 1),
 (2014, 'USA', 17521.8, 2347680.0, 1620480.0, 0),
 (2010, 'CHN', 6087.16, 1393910.0, 1578440.0, 1),
 (2013, 'USA', 16784.8, 2268370.0, 1578430.0, 0)]

<div class="exercise"><b>Exercise 2:</b></div> 

With regards to the `topnames` table, select all rows where the top name is John.  Project all columns and sort by year in descending order. Limit the results to five rows.

The output from my solution is:<br>
<code>
year	sex	 name	count
1923	Male	John	57470
1922	Male	John	57277
1921	Male	John	58217
1920	Male	John	56913
1919	Male	John	53528
</code>

In [5]:
%%sql
/* Enter your SQL query below */
SELECT year, sex, name, count
FROM topnames
WHERE name = 'John'
ORDER BY year DESC
LIMIT 5;

 * sqlite:///book.db
Done.

[(1923, 'Male', 'John', 57470),
 (1922, 'Male', 'John', 57277),
 (1921, 'Male', 'John', 58217),
 (1920, 'Male', 'John', 56913),
 (1919, 'Male', 'John', 53528)]

<div class="exercise"><b>Exercise 3:</b></div> 

With regards to the `topnames` table, select all rows corresponding to males who's name is not John, Noah, nor Michael.  Project all columns and sort by year in descending order. Limit the results to five rows.

The output from my solution is:<br>
<code>
year	sex	 name	 count
2018	Male	Liam	 19837
2017	Male	Liam	 18798
2012	Male	Jacob	19074
2011	Male	Jacob	20371
2010	Male	Jacob	22127
</code>

In [6]:
%%sql
/* Enter your SQL query below */
SELECT year, sex, name, count
FROM topnames
WHERE (name <> 'John' AND name <> 'Noah' AND name <> 'Michael') AND sex = 'Male'
ORDER BY year DESC
LIMIT 5;

 * sqlite:///book.db
Done.

[(2018, 'Male', 'Liam', 19837),
 (2017, 'Male', 'Liam', 18798),
 (2012, 'Male', 'Jacob', 19074),
 (2011, 'Male', 'Jacob', 20371),
 (2010, 'Male', 'Jacob', 22127)]

<div class="exercise"><b>Exercise 4:</b></div> 

With regards to the `indicators` table, select all rows for which the GDP is missing and the population is greater than 140 million.  Project `year`, `code`, `gdp`, and `pop` for such rows and sort by year in ascending order.  No need to limit results.


The output from my solution is:<br>
<code>
year	code   gdp     pop
1982	RUS	None	140.82
1983	RUS	None	141.67
1984	RUS	None	142.74
1985	RUS	None	143.86
1986	RUS	None	144.89
1987	RUS	None	145.91
</code>

In [7]:
%%sql
/* Enter your SQL query below */
SELECT year, code, gdp, pop
FROM indicators
WHERE (gdp IS NULL) AND (pop > 140)
ORDER BY year ASC;

 * sqlite:///book.db
Done.

[(1982, 'RUS', None, 140.82),
 (1983, 'RUS', None, 141.67),
 (1984, 'RUS', None, 142.74),
 (1985, 'RUS', None, 143.86),
 (1986, 'RUS', None, 144.89),
 (1987, 'RUS', None, 145.91)]

<div class="exercise"><b>Exercise 5:</b></div> 

With regards to the `countries` table, select all the rows where the country is classified as `'High income'`.  Project the `code` and `country` fields, plus create a new column called `landmiles` that is the land area in square miles (note that the area in square miles is equal to the square kilometers multiplied by 0.386102).  Sort by `landmiles` in descending order and limit the results to five rows.

The output from my solution is:<br>
<code>
code   country	    landmiles
USA	United States  3531837.15684
CAN	Canada	     3511022.39802
AUS	Australia	  2969904.30604
SAU	Saudi Arabia   829999.60838
CHL	Chile	      287079.192264
</code>

In [8]:
%%sql
/* Enter your SQL query below */
SELECT code, country, land * 0.386102 AS landmiles
FROM countries
WHERE income = 'High income'
ORDER BY landmiles DESC
LIMIT 5;

 * sqlite:///book.db
Done.

[('USA', 'United States', 3531837.15684),
 ('CAN', 'Canada', 3511022.39802),
 ('AUS', 'Australia', 2969904.30604),
 ('SAU', 'Saudi Arabia', 829999.60838),
 ('CHL', 'Chile', 287079.192264)]

**Run the code cell below to connect to the `school.db` database.**

In [9]:
%sql sqlite:///school.db

'Connected: @school.db'

<div class="exercise"><b>Exercise 6:</b></div> 

In reference to the `instructors` table, select a new column `full_name` obtained as the last name, followed by a comma and a space, followed by the first name.  Order alphabetically and limit the results to five rows.

The output from my solution is:<br>
<code>
full_name
Aguilar, Stephen
Anderson, Philip
Arnaud, Antoine
Austin, Stephanie
Bailey, Jayden
</code>

In [10]:
%%sql
/* Enter your SQL query below */
SELECT instructorlast || ', '||''|| ' '|| instructorfirst||'' AS full_name
FROM instructors
ORDER BY full_name ASC
LIMIT 5;

   sqlite:///book.db
 * sqlite:///school.db
Done.

[('Aguilar,  Stephen',),
 ('Anderson,  Philip',),
 ('Arnaud,  Antoine',),
 ('Austin,  Stephanie',),
 ('Bailey,  Jayden',)]

<div class="exercise"><b>Exercise 7:</b></div> 

In reference to the `courses` table, create a new column `catalog` obtained as the course subject, followed by a space, followed by the course number, followed by a colon and a space, followed by the course title. Only include `'MATH'` courses.  Order by course number in descending order and limit the results to five rows.

The output from my solution is:<br>
<code>
catalog
MATH 452: Senior Research
MATH 451: Senior Research
MATH 364: Independent Study
MATH 363: Independent Study
MATH 362: Directed Study
</code>

In [11]:
%%sql
/* Enter your SQL query below */
SELECT coursesubject || ' ' || coursenum||": " || coursetitle AS catalog
FROM courses
WHERE coursesubject = 'MATH'
ORDER BY coursenum DESC
LIMIT 5;

   sqlite:///book.db
 * sqlite:///school.db
Done.

[('MATH 452: Senior Research',),
 ('MATH 451: Senior Research',),
 ('MATH 364: Independent Study',),
 ('MATH 363: Independent Study',),
 ('MATH 362: Directed Study',)]

**Run the code cell below to connect to the `book.db` database.**

In [12]:
%sql sqlite:///book.db

'Connected: @book.db'

<div class="exercise"><b>Exercise 8:</b></div> 

Write an SQL query to determine the number of distinct female names in the `topnames` table.

Below is the output from my solution (can you mimic it?):<br>
<code>
num_female_names
              10
</code>

In [13]:
%%sql
/* Enter your SQL query below */
SELECT COUNT(DISTINCT name) AS num_female_names
FROM topnames
WHERE sex = 'Female';

 * sqlite:///book.db
   sqlite:///school.db
Done.

[(10,)]

<div class="exercise"><b>Exercise 9:</b></div> 

From the `indicators` table, find the average life expectancy, the minimum year, and the maximum number of cell phone subscribers.

Below is the output from my solution (can you mimic it?):<br>
<code>
avg_life	     min_year   max_cell
64.00322182010733	1960	1469.88
</code>

In [14]:
%%sql
/* Enter your SQL query below */
SELECT AVG(life) AS avg_life, MIN(year) AS min_year, MAX(cell) AS max_cell
FROM indicators;

 * sqlite:///book.db
   sqlite:///school.db
Done.

[(64.00322182010733, 1960, 1469.88)]

<div class="exercise"><b>Exercise 10:</b></div> 

With regards to the `indicators` table, use a select query to answer the question: which country and year had the highest cell phone number? **Hint:** use a subquery and MAX to find the overall highest cell phone number, then find which row has that number.

Below is the output from my solution:<br>
<code>
code	year
CHN	2017
</code>

In [15]:
%%sql
/* Enter your SQL query below */
SELECT code, year
FROM indicators
WHERE cell = (SELECT MAX(cell) FROM indicators);

 * sqlite:///book.db
   sqlite:///school.db
Done.

[('CHN', 2017)]

<div class="exercise"><b>Exercise 11:</b></div> 

From the `countries` table, use a query to answer the question: how many countries are there in each region? Alias your new column as `num_countries`.  **Hint:** You will need to use a GROUP BY.

Below is the output from my solution:<br>
<code>
region	                num_countries
East Asia & Pacific	              37
Europe & Central Asia	            58
Latin America & Caribbean	        42
Middle East & North Africa	       21
North America	                     3
South Asia	                        8
Sub-Saharan Africa	               48
</code>

In [16]:
%%sql
/* Enter your SQL query below */
SELECT region, COUNT(region) AS num_countries
FROM countries 
GROUP BY region;

 * sqlite:///book.db
   sqlite:///school.db
Done.

[('East Asia & Pacific', 37),
 ('Europe & Central Asia', 58),
 ('Latin America & Caribbean', 42),
 ('Middle East & North Africa', 21),
 ('North America', 3),
 ('South Asia', 8),
 ('Sub-Saharan Africa', 48)]

<div class="exercise"><b>Exercise 12:</b></div> 

Use the `indicators` table to find the total world population in each year (as the sum of country populations). Use the alias `total_pop` for your new column.  Limit your results to five rows.

Below is the output from my solution:<br>
<code>
year	total_pop
1960	3014.6900000000014
1961	3055.3700000000003
1962	3107.859999999999
1963	3172.6700000000014
1964	3237.700000000004
</code>

In [17]:
%%sql
/* Enter your SQL query below */
SELECT year, SUM(pop) AS total_pop
FROM indicators
GROUP BY year
LIMIT 5;

 * sqlite:///book.db
   sqlite:///school.db
Done.

[(1960, 3014.6900000000014),
 (1961, 3055.3700000000003),
 (1962, 3107.859999999999),
 (1963, 3172.6700000000014),
 (1964, 3237.700000000004)]

<div class="exercise"><b>Exercise 13:</b></div> 

**Treating your query from Exercise 12 as a subquery**, find the maximum for `total_pop` over *all* years. Use the alias `max_pop` for the new column.

Below is the output from my solution:<br>
<code>
max_pop
7567.310000000001
</code>

In [18]:
%%sql
/* Enter your SQL query below */
SELECT MAX(total_pop) AS max_pop
FROM (
    SELECT year, SUM(pop) AS total_pop
    FROM indicators
    GROUP BY year);

 * sqlite:///book.db
   sqlite:///school.db
Done.

[(7567.310000000001,)]

**Run the code cell below to connect to the `school.db` database.**

In [19]:
%sql sqlite:///school.db

'Connected: @school.db'

<div class="exercise"><b>Exercise 14:</b></div> 

In reference to the `school` database, write a query to obtain the number of sections for each class in the fall semester.  However, only include classes having at least 8 sections.  Project the course subject, course number, and a new column called `num_sections`.  **Hint:** You will need to use `GROUP BY classterm, coursesubject, coursenum` to uniquely identify the courses.  Order the results by the number of sections, course number, and course subject using:

`ORDER BY num_sections DESC, classterm, coursesubject, coursenum`

Below is the output from my solution:<br>
<code>
coursesubject	coursenum	num_sections
FYS	                101	          21
FYS	                102	          20
BIOL	               451	          12         
PHED	               350	          11
HIST	               451	           8
</code>

In [20]:
%%sql
/* Enter your SQL query below */

SELECT coursesubject, coursenum, num_sections
FROM(SELECT coursesubject, coursenum, COUNT(classsection) as num_sections
    FROM classes
    WHERE classterm = 'FALL'
    GROUP BY classterm, coursesubject, coursenum
    ORDER BY num_sections DESC, classterm, coursesubject, coursenum)
WHERE num_sections >= 8

   sqlite:///book.db
 * sqlite:///school.db
Done.

[('FYS', 101, 21),
 ('FYS', 102, 20),
 ('BIOL', 451, 12),
 ('PHED', 350, 11),
 ('HIST', 451, 8)]